xwos/XWOS/xwbd/fk429m/bm/stm32cube/xwds/soc.c
struct xwds_soc stm32cube_soc_cb = {
        /* attributes */
        .dev = {
                .name = "stm32cube.soc",
                .id = 0,
                .resources = NULL,
                .drv = xwds_static_cast(struct xwds_driver *, &stm32cube_soc_drv),
                .data = NULL,
        },
        .xwccfg = (void *)&stm32cube_soc_cfg,
        .gpio = {
                .cfg = NULL,
                .pins = stm32cube_gpio_pin_state,
                .port_num = xw_array_size(stm32cube_gpio_pin_state),
                .pin_num = 16,
        },
        .eirq = {
                .isrs = stm32cube_eirq_isr,
                .isrargs = stm32cube_eirq_israrg,
                .num = xw_array_size(stm32cube_eirq_isr),
        },
        .dma = {
                .ccfg = NULL,
                .chstatus = stm32cube_dma_channel_state_map,
                .ch_num = 16,
                .chcbs = stm32cube_dma_cbcb_array,
                .chcbargs = stm32cube_dma_chcbarg_array,
        },
};

/******** ******** ******** ******** ******** ******** ******** ********
 ******** ********      function implementations       ******** ********
 ******** ******** ******** ******** ******** ******** ******** ********/
/******** ******** base driver ******** ********/
static
xwer_t stm32cube_soc_drv_start(struct xwds_device * dev)
{

        XWOS_UNUSED(dev);

        MX_GPIO_Init();
        MX_DMA_Init();
        MX_SDRAM_Init();

        return OK;
}

static
xwer_t stm32cube_soc_drv_stop(struct xwds_device * dev)
{
        XWOS_UNUSED(dev);

        MX_SDRAM_Deinit();
        MX_DMA_Deinit();
        MX_GPIO_Deinit();

        return OK;
}

#if defined(XWMDCFG_ds_PM) && (1 == XWMDCFG_ds_PM)
static
xwer_t stm32cube_soc_drv_suspend(struct xwds_device * dev)
{
        XWOS_UNUSED(dev);
        MX_SDRAM_Suspend();
        MX_DMA_Suspend();
        MX_GPIO_Suspend();
        return OK;
}

static
xwer_t stm32cube_soc_drv_resume(struct xwds_device * dev)
{
        XWOS_UNUSED(dev);
        MX_GPIO_Resume();
        MX_DMA_Resume();
        MX_SDRAM_Resume();
        return OK;
}
#endif /* XWMDCFG_ds_PM */

#if defined(XWMDCFG_ds_SOC_GPIO) && (1 == XWMDCFG_ds_SOC_GPIO)
/******** ******** gpio operation driver ******** ********/
static
xwer_t stm32cube_soc_drv_gpio_req(struct xwds_soc * soc,
                                  xwid_t port, xwsq_t pinmask)
{
        XWOS_UNUSED(soc);
        XWOS_UNUSED(port);
        XWOS_UNUSED(pinmask);
        return OK;
}

static
xwer_t stm32cube_soc_drv_gpio_rls(struct xwds_soc * soc,
                                  xwid_t port, xwsq_t pinmask)
{
        XWOS_UNUSED(soc);
        XWOS_UNUSED(port);
        XWOS_UNUSED(pinmask);
        return OK;
}

static
xwer_t stm32cube_soc_drv_gpio_cfg(struct xwds_soc * soc,
                                  xwid_t port, xwsq_t pinmask,
                                  void * cfg)
{
        const struct stm32cube_soc_cfg * xwccfg;
        LL_GPIO_InitTypeDef * llcfg;
        GPIO_TypeDef * gpio;
        xwreg_t cpuirq;
        ErrorStatus es;
        xwer_t rc;

        xwccfg = soc->xwccfg;

        llcfg = cfg;
        gpio = xwccfg->gpio.register_map[port];
        soc_cpuirq_save_lc(&cpuirq);
        es = LL_GPIO_Init(gpio, llcfg);
        soc_cpuirq_restore_lc(cpuirq);
        if (SUCCESS == es) {
                rc = OK;
        } else {
                rc = -EINVAL;
        }
        return rc;
}

static
xwer_t stm32cube_soc_drv_gpio_set(struct xwds_soc * soc,
                                  xwid_t port, xwsq_t pinmask)
{
        const struct stm32cube_soc_cfg * xwccfg;
        GPIO_TypeDef * gpio;
        xwreg_t cpuirq;

        xwccfg = soc->xwccfg;

        gpio = xwccfg->gpio.register_map[port];
        soc_cpuirq_save_lc(&cpuirq);
        LL_GPIO_SetOutputPin(gpio, pinmask);
        soc_cpuirq_restore_lc(cpuirq);
        return OK;
}

static
xwer_t stm32cube_soc_drv_gpio_reset(struct xwds_soc * soc,
                                    xwid_t port, xwsq_t pinmask)
{
        const struct stm32cube_soc_cfg * xwccfg;
        GPIO_TypeDef * gpio;
        xwreg_t cpuirq;

        xwccfg = soc->xwccfg;

        gpio = xwccfg->gpio.register_map[port];
        soc_cpuirq_save_lc(&cpuirq);
        LL_GPIO_ResetOutputPin(gpio, pinmask);
        soc_cpuirq_restore_lc(cpuirq);
        return OK;
}

static
xwer_t stm32cube_soc_drv_gpio_toggle(struct xwds_soc * soc,
                                     xwid_t port, xwsq_t pinmask)
{
        const struct stm32cube_soc_cfg * xwccfg;
        GPIO_TypeDef * gpio;
        xwreg_t cpuirq;

        xwccfg = soc->xwccfg;

        gpio = xwccfg->gpio.register_map[port];
        soc_cpuirq_save_lc(&cpuirq);
        LL_GPIO_TogglePin(gpio, pinmask);
        soc_cpuirq_restore_lc(cpuirq);
        return OK;
}

static
xwer_t stm32cube_soc_drv_gpio_output(struct xwds_soc * soc,
                                     xwid_t port, xwsq_t pinmask,
                                     xwsq_t out)
{
        const struct stm32cube_soc_cfg * xwccfg;
        GPIO_TypeDef * gpio;
        xwreg_t cpuirq;
        xwu32_t regval;

        xwccfg = soc->xwccfg;

        gpio = xwccfg->gpio.register_map[port];
        out &= pinmask;
        soc_cpuirq_save_lc(&cpuirq);
        regval = LL_GPIO_ReadOutputPort(gpio);
        regval &= (xwu32_t)(~(out ^ pinmask));
        regval |= (xwu32_t)(out & pinmask);
        LL_GPIO_WriteOutputPort(gpio, regval);
        soc_cpuirq_restore_lc(cpuirq);
        return OK;
}

static
xwer_t stm32cube_soc_drv_gpio_input(struct xwds_soc * soc,
                                    xwid_t port, xwsq_t pinmask,
                                    xwsq_t * in)
{
        const struct stm32cube_soc_cfg * xwccfg;
        GPIO_TypeDef * gpio;
        xwu32_t regval;

        xwccfg = soc->xwccfg;

        gpio = xwccfg->gpio.register_map[port];
        regval = LL_GPIO_ReadInputPort(gpio);
        *in = pinmask & (xwsq_t)regval;
        return OK;
}
#endif /* XWMDCFG_ds_SOC_GPIO */

#if defined(XWMDCFG_ds_SOC_EIRQ) && (1 == XWMDCFG_ds_SOC_EIRQ)
/******** ******** EIRQ operation driver ******** ********/
static
xwer_t stm32cube_soc_drv_eirq_req(struct xwds_soc * soc,
                                  xwid_t port, xwsq_t pinmask,
                                  xwid_t eiid, xwsq_t eiflag)
{
        const struct stm32cube_soc_cfg * xwccfg;
        LL_EXTI_InitTypeDef eicfg;
        xwu32_t syscfg_exti_port;
        xwu32_t syscfg_exti_line;
        uint32_t cubelibrc;
        xwer_t rc;

        xwccfg = soc->xwccfg;

        syscfg_exti_port = xwccfg->eirq.exti_port_map[port];
        if (BIT(eiid) == pinmask) {
                syscfg_exti_line = xwccfg->eirq.exti_line_map[eiid];
                LL_SYSCFG_SetEXTISource(syscfg_exti_port, syscfg_exti_line);
                eicfg.Line_0_31 = pinmask;
                eicfg.LineCommand = ENABLE;
                eicfg.Mode = LL_EXTI_MODE_IT;
                eicfg.Trigger = LL_EXTI_TRIGGER_NONE;
                if (XWDS_SOC_EIF_TM_RISING & eiflag) {
                        eicfg.Trigger |= LL_EXTI_TRIGGER_RISING;
                } else {
                        eicfg.Trigger &= ~(LL_EXTI_TRIGGER_RISING);
                }
                if (XWDS_SOC_EIF_TM_FALLING & eiflag) {
                        eicfg.Trigger |= LL_EXTI_TRIGGER_FALLING;
                } else {
                        eicfg.Trigger &= ~(LL_EXTI_TRIGGER_FALLING);
                }
                cubelibrc = LL_EXTI_Init(&eicfg);
                if (SUCCESS == cubelibrc) {
                        rc = OK;
                } else {
                        rc = -EINVAL;
                }
        } else {
                rc = -EINVAL;
        }
        return rc;
}

static
xwer_t stm32cube_soc_drv_eirq_rls(struct xwds_soc * soc,
                                  xwid_t port, xwsq_t pinmask,
                                  xwid_t eiid)
{
        LL_EXTI_InitTypeDef eicfg;

        XWOS_UNUSED(soc);
        XWOS_UNUSED(port);
        XWOS_UNUSED(eiid);

        eicfg.Line_0_31 = pinmask;
        eicfg.LineCommand = DISABLE;
        eicfg.Mode = LL_EXTI_MODE_IT;
        eicfg.Trigger = LL_EXTI_TRIGGER_NONE;
        LL_EXTI_Init(&eicfg);

        return OK;
}

#endif /* XWMDCFG_ds_SOC_EIRQ */

