xwos/XWOS/xwbd/fk429m/bm/stm32cube/xwds/soc.c
#endif /* XWMDCFG_ds_SOC_DMA */

#if defined(XWMDCFG_ds_SOC_ERAM) && (1 == XWMDCFG_ds_SOC_ERAM)
/******** ******** ERAM ******** ********/
static
xwer_t stm32cube_soc_drv_eram_tst(struct xwds_soc * soc, xwptr_t * erraddr)
{
        xwsq_t i;
        xwsz_t * origin;
        xwsz_t size;
        xwer_t rc;

        rc = OK;
        origin = (xwsz_t *)soc->eram.origin;
        size = soc->eram.size / sizeof(xwsz_t);

        for (i = 0; i < size; i++) {
                origin[i] = i;
        }
        for (i = 0; i < size; i++) {
                if (origin[i] != i) {
                        *erraddr = (xwptr_t)&origin[i];
                        rc = -EIO;
                        break;
                }
        }
        return rc;
}
#endif /* XWMDCFG_ds_SOC_ERAM */

/******** ******** ISR ******** ********/
void stm32cube_exti_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwsid_t eiid;
        xwu32_t pr;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        do {
                pr = LL_EXTI_ReadFlag_0_31(LL_EXTI_LINE_ALL);
                eiid = (xwsid_t)xwbop_fls(xwu32_t, pr);
                if (eiid >= 0) {
                        if (!is_err_or_null(soc->eirq.isrs[eiid])) {
                                soc->eirq.isrs[eiid](soc, (xwid_t)eiid,
                                                     soc->eirq.isrargs[eiid]);
                        }/* else {} */
                        LL_EXTI_ClearFlag_0_31(BIT(eiid));
                } else {
                        break;
                }
        } while (true);
}

void stm32cube_dma1_stream0_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE0(DMA1)) {
                LL_DMA_ClearFlag_FE0(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME0(DMA1)) {
                LL_DMA_ClearFlag_DME0(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE0(DMA1)) {
                LL_DMA_ClearFlag_TE0(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT0(DMA1)) {
                LL_DMA_ClearFlag_HT0(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC0(DMA1)) {
                LL_DMA_ClearFlag_TC0(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[0])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[0](soc, XWDS_DMA_CH(0), dmarc,
                                          soc->dma.chcbargs[0]);
                } else {
                        soc->dma.chcbs[0](soc, XWDS_DMA_CH(0), dmarc, NULL);
                }
        }
}

void stm32cube_dma1_stream1_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE1(DMA1)) {
                LL_DMA_ClearFlag_FE1(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME1(DMA1)) {
                LL_DMA_ClearFlag_DME1(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE1(DMA1)) {
                LL_DMA_ClearFlag_TE1(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT1(DMA1)) {
                LL_DMA_ClearFlag_HT1(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC1(DMA1)) {
                LL_DMA_ClearFlag_TC1(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[1])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[1](soc, XWDS_DMA_CH(1), dmarc,
                                          soc->dma.chcbargs[1]);
                } else {
                        soc->dma.chcbs[1](soc, XWDS_DMA_CH(1), dmarc, NULL);
                }
        }
}

void stm32cube_dma1_stream2_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE2(DMA1)) {
                LL_DMA_ClearFlag_FE2(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME2(DMA1)) {
                LL_DMA_ClearFlag_DME2(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE2(DMA1)) {
                LL_DMA_ClearFlag_TE2(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT2(DMA1)) {
                LL_DMA_ClearFlag_HT2(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC2(DMA1)) {
                LL_DMA_ClearFlag_TC2(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[2])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[2](soc, XWDS_DMA_CH(2), dmarc,
                                          soc->dma.chcbargs[2]);
                } else {
                        soc->dma.chcbs[2](soc, XWDS_DMA_CH(2), dmarc, NULL);
                }
        }
}

void stm32cube_dma1_stream3_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE3(DMA1)) {
                LL_DMA_ClearFlag_FE3(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME3(DMA1)) {
                LL_DMA_ClearFlag_DME3(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE3(DMA1)) {
                LL_DMA_ClearFlag_TE3(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT3(DMA1)) {
                LL_DMA_ClearFlag_HT3(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC3(DMA1)) {
                LL_DMA_ClearFlag_TC3(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[3])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[3](soc, XWDS_DMA_CH(3), dmarc,
                                          soc->dma.chcbargs[3]);
                } else {
                        soc->dma.chcbs[3](soc, XWDS_DMA_CH(3), dmarc, NULL);
                }
        }
}

void stm32cube_dma1_stream4_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE4(DMA1)) {
                LL_DMA_ClearFlag_FE4(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME4(DMA1)) {
                LL_DMA_ClearFlag_DME4(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE4(DMA1)) {
                LL_DMA_ClearFlag_TE4(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT4(DMA1)) {
                LL_DMA_ClearFlag_HT4(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC4(DMA1)) {
                LL_DMA_ClearFlag_TC4(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[4])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[4](soc, XWDS_DMA_CH(4), dmarc,
                                          soc->dma.chcbargs[4]);
                } else {
                        soc->dma.chcbs[4](soc, XWDS_DMA_CH(4), dmarc, NULL);
                }
        }
}

void stm32cube_dma1_stream5_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE5(DMA1)) {
                LL_DMA_ClearFlag_FE5(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME5(DMA1)) {
                LL_DMA_ClearFlag_DME5(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE5(DMA1)) {
                LL_DMA_ClearFlag_TE5(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT5(DMA1)) {
                LL_DMA_ClearFlag_HT5(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC5(DMA1)) {
                LL_DMA_ClearFlag_TC5(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

