xwos/XWOS/xwbd/fk429m/bm/stm32cube/xwds/soc.c
        if ((soc->dma.chcbs) && (soc->dma.chcbs[5])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[5](soc, XWDS_DMA_CH(5), dmarc,
                                          soc->dma.chcbargs[5]);
                } else {
                        soc->dma.chcbs[5](soc, XWDS_DMA_CH(5), dmarc, NULL);
                }
        }
}

void stm32cube_dma1_stream6_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE6(DMA1)) {
                LL_DMA_ClearFlag_FE6(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME6(DMA1)) {
                LL_DMA_ClearFlag_DME6(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE6(DMA1)) {
                LL_DMA_ClearFlag_TE6(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT6(DMA1)) {
                LL_DMA_ClearFlag_HT6(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC6(DMA1)) {
                LL_DMA_ClearFlag_TC6(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[6])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[6](soc, XWDS_DMA_CH(6), dmarc,
                                          soc->dma.chcbargs[6]);
                } else {
                        soc->dma.chcbs[6](soc, XWDS_DMA_CH(6), dmarc, NULL);
                }
        }
}

void stm32cube_dma1_stream7_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE7(DMA1)) {
                LL_DMA_ClearFlag_FE7(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME7(DMA1)) {
                LL_DMA_ClearFlag_DME7(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE7(DMA1)) {
                LL_DMA_ClearFlag_TE7(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT7(DMA1)) {
                LL_DMA_ClearFlag_HT7(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC7(DMA1)) {
                LL_DMA_ClearFlag_TC7(DMA1);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[7])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[7](soc, XWDS_DMA_CH(7), dmarc,
                                          soc->dma.chcbargs[7]);
                } else {
                        soc->dma.chcbs[7](soc, XWDS_DMA_CH(7), dmarc, NULL);
                }
        }
}

void stm32cube_dma2_stream0_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE0(DMA2)) {
                LL_DMA_ClearFlag_FE0(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME0(DMA2)) {
                LL_DMA_ClearFlag_DME0(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE0(DMA2)) {
                LL_DMA_ClearFlag_TE0(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT0(DMA2)) {
                LL_DMA_ClearFlag_HT0(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC0(DMA2)) {
                LL_DMA_ClearFlag_TC0(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[8])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[0](soc, XWDS_DMA_CH(8), dmarc,
                                          soc->dma.chcbargs[8]);
                } else {
                        soc->dma.chcbs[0](soc, XWDS_DMA_CH(8), dmarc, NULL);
                }
        }
}

void stm32cube_dma2_stream1_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE1(DMA2)) {
                LL_DMA_ClearFlag_FE1(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME1(DMA2)) {
                LL_DMA_ClearFlag_DME1(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE1(DMA2)) {
                LL_DMA_ClearFlag_TE1(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT1(DMA2)) {
                LL_DMA_ClearFlag_HT1(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC1(DMA2)) {
                LL_DMA_ClearFlag_TC1(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[9])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[9](soc, XWDS_DMA_CH(9), dmarc,
                                          soc->dma.chcbargs[9]);
                } else {
                        soc->dma.chcbs[9](soc, XWDS_DMA_CH(9), dmarc, NULL);
                }
        }
}

void stm32cube_dma2_stream2_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE2(DMA2)) {
                LL_DMA_ClearFlag_FE2(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME2(DMA2)) {
                LL_DMA_ClearFlag_DME2(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE2(DMA2)) {
                LL_DMA_ClearFlag_TE2(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT2(DMA2)) {
                LL_DMA_ClearFlag_HT2(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC2(DMA2)) {
                LL_DMA_ClearFlag_TC2(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

