xwos/XWOS/xwbd/fk429m/bm/stm32cube/xwds/soc.c
        if ((soc->dma.chcbs) && (soc->dma.chcbs[10])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[10](soc, XWDS_DMA_CH(10), dmarc,
                                           soc->dma.chcbargs[10]);
                } else {
                        soc->dma.chcbs[10](soc, XWDS_DMA_CH(10), dmarc, NULL);
                }
        }
}

void stm32cube_dma2_stream3_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE3(DMA2)) {
                LL_DMA_ClearFlag_FE3(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME3(DMA2)) {
                LL_DMA_ClearFlag_DME3(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE3(DMA2)) {
                LL_DMA_ClearFlag_TE3(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT3(DMA2)) {
                LL_DMA_ClearFlag_HT3(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC3(DMA2)) {
                LL_DMA_ClearFlag_TC3(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[11])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[11](soc, XWDS_DMA_CH(11), dmarc,
                                           soc->dma.chcbargs[11]);
                } else {
                        soc->dma.chcbs[11](soc, XWDS_DMA_CH(11), dmarc, NULL);
                }
        }
}

void stm32cube_dma2_stream4_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE4(DMA2)) {
                LL_DMA_ClearFlag_FE4(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME4(DMA2)) {
                LL_DMA_ClearFlag_DME4(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE4(DMA2)) {
                LL_DMA_ClearFlag_TE4(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT4(DMA2)) {
                LL_DMA_ClearFlag_HT4(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC4(DMA2)) {
                LL_DMA_ClearFlag_TC4(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[12])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[12](soc, XWDS_DMA_CH(12), dmarc,
                                           soc->dma.chcbargs[12]);
                } else {
                        soc->dma.chcbs[12](soc, XWDS_DMA_CH(12), dmarc, NULL);
                }
        }
}

void stm32cube_dma2_stream5_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE5(DMA2)) {
                LL_DMA_ClearFlag_FE5(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME5(DMA2)) {
                LL_DMA_ClearFlag_DME5(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE5(DMA2)) {
                LL_DMA_ClearFlag_TE5(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT5(DMA2)) {
                LL_DMA_ClearFlag_HT5(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC5(DMA2)) {
                LL_DMA_ClearFlag_TC5(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[13])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[13](soc, XWDS_DMA_CH(13), dmarc,
                                           soc->dma.chcbargs[13]);
                } else {
                        soc->dma.chcbs[13](soc, XWDS_DMA_CH(13), dmarc, NULL);
                }
        }
}

void stm32cube_dma2_stream6_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE6(DMA2)) {
                LL_DMA_ClearFlag_FE6(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME6(DMA2)) {
                LL_DMA_ClearFlag_DME6(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE6(DMA2)) {
                LL_DMA_ClearFlag_TE6(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT6(DMA2)) {
                LL_DMA_ClearFlag_HT6(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC6(DMA2)) {
                LL_DMA_ClearFlag_TC6(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[14])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[14](soc, XWDS_DMA_CH(14), dmarc,
                                           soc->dma.chcbargs[14]);
                } else {
                        soc->dma.chcbs[14](soc, XWDS_DMA_CH(14), dmarc, NULL);
                }
        }
}

void stm32cube_dma2_stream7_isr(void)
{
        xwirq_t irqn;
        struct soc_irq_data irqdata;
        struct xwds_soc * soc;
        xwu32_t dmarc;

        xwos_irq_get_id(&irqn);
        xwos_irq_get_data(irqn, &irqdata);
        soc = irqdata.data;

        dmarc = 0;
        if (LL_DMA_IsActiveFlag_FE7(DMA2)) {
                LL_DMA_ClearFlag_FE7(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_FE;
        }
        if (LL_DMA_IsActiveFlag_DME7(DMA2)) {
                LL_DMA_ClearFlag_DME7(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_DME;
        }
        if (LL_DMA_IsActiveFlag_TE7(DMA2)) {
                LL_DMA_ClearFlag_TE7(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TE;
        }
        if (LL_DMA_IsActiveFlag_HT7(DMA2)) {
                LL_DMA_ClearFlag_HT7(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_HT;
        }
        if (LL_DMA_IsActiveFlag_TC7(DMA2)) {
                LL_DMA_ClearFlag_TC7(DMA2);
                dmarc |= STM32CUBE_SOC_DMA_RC_TC;
        }

        if ((soc->dma.chcbs) && (soc->dma.chcbs[15])) {
                if (soc->dma.chcbargs) {
                        soc->dma.chcbs[15](soc, XWDS_DMA_CH(15), dmarc,
                                           soc->dma.chcbargs[15]);
                } else {
                        soc->dma.chcbs[15](soc, XWDS_DMA_CH(15), dmarc, NULL);
                }
        }
}
